ab_test_stat_nginx.txt
-----------------------TRY 1-----------------------

This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.10.3
Server Hostname:        localhost
Server Port:            80

Document Path:          /httptest/wikipedia_russia.html
Document Length:        954824 bytes

Concurrency Level:      100
Time taken for tests:   0.533 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      955071000 bytes
HTML transferred:       954824000 bytes
Requests per second:    1876.11 [#/sec] (mean)
Time per request:       53.302 [ms] (mean)
Time per request:       0.533 [ms] (mean, across all concurrent requests)
Transfer rate:          1749821.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      0       8
Processing:     9   41  56.6     16     224
Waiting:        0    2   4.8      0      22
Total:          9   42  56.8     17     225
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%     17
  66%     33
  75%     41
  80%     52
  90%     61
  95%    210
  98%    218
  99%    220
 100%    225 (longest request)

-----------------------TRY 2-----------------------

This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.10.3
Server Hostname:        localhost
Server Port:            80

Document Path:          /httptest/wikipedia_russia.html
Document Length:        954824 bytes

Concurrency Level:      100
Time taken for tests:   0.487 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      955071000 bytes
HTML transferred:       954824000 bytes
Requests per second:    2053.19 [#/sec] (mean)
Time per request:       48.705 [ms] (mean)
Time per request:       0.487 [ms] (mean, across all concurrent requests)
Transfer rate:          1914982.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.0      0       8
Processing:     1   37  66.3     11     265
Waiting:        0    3   5.1      1      32
Total:          2   38  67.8     11     273

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     15
  75%     22
  80%     34
  90%     73
  95%    239
  98%    257
  99%    270
 100%    273 (longest request)

-----------------------TRY 3-----------------------

This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.10.3
Server Hostname:        localhost
Server Port:            80

Document Path:          /httptest/wikipedia_russia.html
Document Length:        954824 bytes

Concurrency Level:      100
Time taken for tests:   0.481 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      955071000 bytes
HTML transferred:       954824000 bytes
Requests per second:    2080.47 [#/sec] (mean)
Time per request:       48.066 [ms] (mean)
Time per request:       0.481 [ms] (mean, across all concurrent requests)
Transfer rate:          1940424.80 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0       4
Processing:     5   36  56.3     15     231
Waiting:        0    1   2.1      1      13
Total:          8   37  56.5     16     231

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     21
  75%     32
  80%     36
  90%     63
  95%    213
  98%    219
  99%    219
 100%    231 (longest request)